performance-testing/scripts/Nupakachi_Performance_Test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>

    <TestPlan guiclass="TestPlanGui"
              testclass="TestPlan"
              testname="Nupakachi Full Performance Test TC46-TC63"
              enabled="true">

      <stringProp name="TestPlan.comments">
        Full Performance &amp; Reliability Testing
      </stringProp>

      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>

      <elementProp name="TestPlan.user_defined_variables"
                   elementType="Arguments"
                   guiclass="ArgumentsPanel"
                   testclass="Arguments"
                   enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>

    </TestPlan>

    <hashTree>

      <!-- HTTP DEFAULTS -->

      <ConfigTestElement guiclass="HttpDefaultsGui"
                         testclass="ConfigTestElement"
                         testname="HTTP Request Defaults"
                         enabled="true">

        <elementProp name="HTTPsampler.Arguments"
                     elementType="Arguments"
                     guiclass="HTTPArgumentsPanel"
                     testclass="Arguments"
                     enabled="true">

          <collectionProp name="Arguments.arguments"/>

        </elementProp>

        <stringProp name="HTTPSampler.domain">nupakachi.somee.com</stringProp>
        <stringProp name="HTTPSampler.protocol">https</stringProp>

        <stringProp name="HTTPSampler.connect_timeout">15000</stringProp>
        <stringProp name="HTTPSampler.response_timeout">30000</stringProp>

      </ConfigTestElement>

      <hashTree/>

      <!-- COOKIE -->

      <CookieManager guiclass="CookiePanel"
                     testclass="CookieManager"
                     testname="HTTP Cookie Manager"
                     enabled="true">

        <boolProp name="CookieManager.clearEachIteration">false</boolProp>

      </CookieManager>

      <hashTree/>

      <!-- CACHE -->

      <CacheManager guiclass="CacheManagerGui"
                    testclass="CacheManager"
                    testname="HTTP Cache Manager"
                    enabled="true"/>

      <hashTree/>

      <!-- HEADER -->

      <HeaderManager guiclass="HeaderPanel"
                     testclass="HeaderManager"
                     testname="HTTP Header Manager"
                     enabled="true">

        <collectionProp name="HeaderManager.headers">

          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">User-Agent</stringProp>
            <stringProp name="Header.value">
              Mozilla/5.0 (Windows NT 10.0; Win64; x64)
            </stringProp>
          </elementProp>

        </collectionProp>

      </HeaderManager>

      <hashTree/>

      <!-- ================================================= -->
      <!-- TEMPLATE THREADGROUP -->
      <!-- COPY FOR TC46 -> TC63 -->
      <!-- ================================================= -->

      <!-- TC46 -->

      <ThreadGroup guiclass="ThreadGroupGui"
                   testclass="ThreadGroup"
                   testname="TC46"
                   enabled="true">

        <stringProp name="ThreadGroup.num_threads">50</stringProp>

        <stringProp name="ThreadGroup.ramp_time">30</stringProp>

        <boolProp name="ThreadGroup.scheduler">false</boolProp>

        <elementProp name="ThreadGroup.main_controller"
                     elementType="LoopController"
                     guiclass="LoopControlPanel"
                     testclass="LoopController"
                     enabled="true">

          <boolProp name="LoopController.continue_forever">false</boolProp>

          <stringProp name="LoopController.loops">1</stringProp>

        </elementProp>

      </ThreadGroup>

      <hashTree>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui"
                          testclass="HTTPSamplerProxy"
                          testname="TC46 Request"
                          enabled="true">

          <elementProp name="HTTPsampler.Arguments"
                       elementType="Arguments"
                       guiclass="HTTPArgumentsPanel"
                       testclass="Arguments"
                       enabled="true">

            <collectionProp name="Arguments.arguments"/>

          </elementProp>

          <stringProp name="HTTPSampler.path">
            /Admin/BaocaoThongKe
          </stringProp>

          <stringProp name="HTTPSampler.method">GET</stringProp>

        </HTTPSamplerProxy>

        <hashTree/>

      </hashTree>

           <!-- TC47 -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="TC47 - Load test 200 users lọc báo cáo" enabled="true">
        <stringProp name="ThreadGroup.num_threads">200</stringProp>
        <stringProp name="ThreadGroup.ramp_time">60</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="TC47 - Lọc báo cáo" enabled="true">
          <stringProp name="HTTPSampler.path">/Admin/QuanTriAdmin</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>

      <!-- TC48 -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="TC48 - Concurrent 500 users" enabled="true">
        <stringProp name="ThreadGroup.num_threads">500</stringProp>
        <stringProp name="ThreadGroup.ramp_time">45</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="TC48 - Concurrent" enabled="true">
          <stringProp name="HTTPSampler.path">/Admin/BaocaoThongKe</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>

      <!-- TC49 -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="TC49 - Response time API revenue" enabled="true">
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">20</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="TC49 - Revenue API" enabled="true">
          <stringProp name="HTTPSampler.path">/api/reports/revenue</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>

      <!-- TC50 -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="TC50 - Throughput API báo cáo" enabled="true">
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">30</stringProp>
        <stringProp name="ThreadGroup.duration">300</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="TC50 - Throughput" enabled="true">
          <stringProp name="HTTPSampler.path">/Admin/BaocaoThongKe</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>

      <!-- TC51 -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="TC51 - Stress Test tăng dần" enabled="true">
        <stringProp name="ThreadGroup.num_threads">700</stringProp>
        <stringProp name="ThreadGroup.ramp_time">120</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="TC51 - Stress" enabled="true">
          <stringProp name="HTTPSampler.path">/Admin/BaocaoThongKe</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>

      <!-- TC52 -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="TC52 - Export Excel dữ liệu lớn" enabled="true">
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">15</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="TC52 - Export Excel" enabled="true">
          <stringProp name="HTTPSampler.path">/Admin/ExportExcel</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>

      <!-- TC53 -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="TC53 - Tải biểu đồ 12 tháng" enabled="true">
        <stringProp name="ThreadGroup.num_threads">30</stringProp>
        <stringProp name="ThreadGroup.ramp_time">20</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="TC53 - Chart Data" enabled="true">
          <stringProp name="HTTPSampler.path">/Admin/ChartData</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>

      <!-- TC54 -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="TC54 - Database timeout lọc dữ liệu lớn" enabled="true">
        <stringProp name="ThreadGroup.num_threads">80</stringProp>
        <stringProp name="ThreadGroup.ramp_time">40</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="TC54 - DB Timeout Test" enabled="true">
          <stringProp name="HTTPSampler.path">/Admin/BaocaoThongKe</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>

      <!-- TC55 -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="TC55 - Error rate dưới tải thường" enabled="true">
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">30</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="TC55 - Error Rate Test" enabled="true">
          <stringProp name="HTTPSampler.path">/Admin/ErrorTest</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>

      <!-- TC56 -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="TC56 - Reliability 24h" enabled="true">
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">30</stringProp>
        <stringProp name="ThreadGroup.duration">86400</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="TC56 - Continuous Load" enabled="true">
          <stringProp name="HTTPSampler.path">/Admin/BaocaoThongKe</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>

      <!-- TC57 -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="TC57 - Memory Leak Check" enabled="true">
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">20</stringProp>
        <stringProp name="ThreadGroup.duration">14400</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="TC57 - Memory Leak" enabled="true">
          <stringProp name="HTTPSampler.path">/Admin/BaocaoThongKe</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>

      <!-- TC58 -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="TC58 - Long Session Testing" enabled="true">
        <stringProp name="ThreadGroup.num_threads">20</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <stringProp name="ThreadGroup.duration">7200</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="TC58 - Long Session" enabled="true">
          <stringProp name="HTTPSampler.path">/Admin/QuanTriAdmin</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>

      <!-- TC59 -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="TC59 - Repeated Export 100 lần" enabled="true">
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" enabled="true">
          <stringProp name="LoopController.loops">100</stringProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="TC59 - Export Excel 100 times" enabled="true">
          <stringProp name="HTTPSampler.path">/Admin/ExportExcel</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>

      <!-- TC60 -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="TC60 - Continuous API Requests" enabled="true">
        <stringProp name="ThreadGroup.num_threads">30</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <stringProp name="ThreadGroup.duration">21600</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="TC60 - Continuous API" enabled="true">
          <stringProp name="HTTPSampler.path">/api/reports/revenue</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>

      <!-- TC61 -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="TC61 - Database Disconnection" enabled="true">
        <stringProp name="ThreadGroup.num_threads">40</stringProp>
        <stringProp name="ThreadGroup.ramp_time">20</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="TC61 - DB Failover" enabled="true">
          <stringProp name="HTTPSampler.path">/Admin/BaocaoThongKe</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>

      <!-- TC62 -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="TC62 - Log File Full Test" enabled="true">
        <stringProp name="ThreadGroup.num_threads">30</stringProp>
        <stringProp name="ThreadGroup.ramp_time">15</stringProp>
        <stringProp name="ThreadGroup.duration">14400</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="TC62 - Log Test" enabled="true">
          <stringProp name="HTTPSampler.path">/Admin/BaocaoThongKe</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>

      <!-- TC63 -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="TC63 - Data Consistency After Endurance" enabled="true">
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">30</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="TC63 - Data Consistency" enabled="true">
          <stringProp name="HTTPSampler.path">/Admin/BaocaoThongKe</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
      <!-- LISTENERS -->

      <ResultCollector guiclass="ViewResultsFullVisualizer"
                       testclass="ResultCollector"
                       testname="View Results Tree"
                       enabled="true">

        <boolProp name="ResultCollector.error_logging">false</boolProp>

      </ResultCollector>

      <hashTree/>

      <ResultCollector guiclass="SummaryReport"
                       testclass="ResultCollector"
                       testname="Summary Report"
                       enabled="true">

        <boolProp name="ResultCollector.error_logging">false</boolProp>

      </ResultCollector>

      <hashTree/>

      <ResultCollector guiclass="AggregateReport"
                       testclass="ResultCollector"
                       testname="Aggregate Report"
                       enabled="true">

        <boolProp name="ResultCollector.error_logging">false</boolProp>

      </ResultCollector>

      <hashTree/>

    </hashTree>

  </hashTree>

</jmeterTestPlan>